xXAlgoorXx/Projectwork2_Code/ST32N6AI/image_classification/STM32N6/Application/NUCLEO-N657X0-Q/Src/main.c
 /**
 ******************************************************************************
 * @file    main.c
 * @author  GPM Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include "stm32n6xx_hal.h"
#include "stm32n6xx_nucleo_bus.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "stm32n6xx_nucleo.h"

#include "app_fuseprogramming.h"
#include "stm32_lcd_ex.h"
#include "ll_aton_runtime.h"
#include "main.h"
#include <stdio.h>
//#include "app_config.h"

#include "nn_sim.h"
#include "ATON_MatMul.h"
#include "SIMD_MatMul.h"
#include "tiledFFT.h"
#include "arm_math.h"
#include "dsp/matrix_functions.h"

COM_InitTypeDef BspCOMInit;
static void SystemClock_Config(void);
static void NPURam_enable(void);
static void NPUCache_config(void);

#define MAX_NUMBER_OUTPUT 1

static void Security_Config(void);
static void set_clk_sleep_mode(void);
static void IAC_Config(void);

static void Hardware_init(void);

// Lukas added functions
void Error_Handler(void);
void controllOutput(int8_t* in, int8_t* weights, size_t insize, size_t outsize);
void setOutputZero(int8_t* outp, size_t size);
int main_NPU_test(void);
int tiledMatVec(void);
void printMatrix_int8(const int8_t* mat, size_t rows, size_t cols);
void printVector_int8(const char* message, const int8_t* vec, size_t size);

int preformanceMeasurment_int8(void);
int NPU_MatMul_int8(size_t insize,size_t outsize);
int NPU_MatMul_float(size_t insize,size_t outsize);
int ARM_MatMul_int8(size_t insize,size_t outsize);
int ARM_MatMul_float(size_t insize,size_t outsize);

void enableTiming_Cyc(void){
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;  // Enable cycle counter
}

void startTiming_Cyc(void){
	DWT->CYCCNT = 0; // Reset counter
}

uint32_t getTiming_Cyc(){
	uint32_t cycles = DWT->CYCCNT;
	return cycles;
}

int main(void)
{
	Hardware_init();
	enableTiming_Cyc();
//	preformanceMeasurment_int8();
	tiledMatVec();

}

int tiledFFT_test(void){
	size_t N = 8;
	int8_t in[N];
	int8_t outReal[N];
	int8_t outImag[N];

    for (int i = 0; i < N; i++) {
    	in[i] = (int8_t)((i) % 256);  // Example input: cycles through -128 to 127
    }

    tiledDFT(in,outReal,outImag,N);
	printVector_int8("DFT Real:",outReal,N);
	printVector_int8("DFT Imag:",outImag,N);
}


int tiledMatVec(void){
//	int npu_tiledmatvec_int8(int8_t* invec,size_t insize,int8_t* outvec, size_t outsize, int8_t* inMat)
	size_t insize = 7;
	size_t outsize = 7;
    int8_t inVec[insize];
    int8_t outVec[outsize];

    printf("Tiled MatVec Size: %4d\n\r",insize);
    for (int i = 0; i < insize; i++) {
    	inVec[i] = (int8_t)((i) % 256);  // Example input: cycles through -128 to 127
    }

    int8_t* identityWeights = getIdentityWeights_int8(insize,outsize);
    printMatrix_int8(identityWeights,outsize,insize);
    while(1){
    	startTiming_Cyc();
    	npu_tiledmatvec_int8(inVec,insize,outVec,outsize,identityWeights);
    	uint32_t cycles = getTiming_Cyc();
    	printf("Cycles: %4d\n\r", cycles);
    	for(size_t i = 0;i < outsize;i++){
    		float output = outVec[i];
    		printf("Output %2d: %4.0f\n\r",i,output);
    	}
    }
}


int preformanceMeasurment_int8(void){
	size_t insize = 64;
	size_t outsize = 64;
	size_t base = 16;
	for(int i  = 0; i< 7;i++){

		insize  = base << i;
		outsize = base << i;
		printf("========");
		printf("Size: %4d\n\r",insize);
//		ARM_MatMul_int8(insize,outsize);
//		NPU_MatMul_int8(insize,outsize);
//		ARM_MatMul_float(insize,outsize);
//		NPU_MatMul_float(insize,outsize);
	}
}


int NPU_MatMul_int8(size_t insize,size_t outsize){
	Hardware_init();
//	printf("=== MatMul int8 Main ===\n\r");

    int8_t inVec[insize];
    for (int i = 0; i < insize; i++) {
    	inVec[i] = (int8_t)((i) % 256);  // Example input: cycles through -128 to 127
    }
    int8_t* identityWeights = getIdentityWeights_int8(insize,outsize);
    int8_t* outvector;

	npu_matvec_int8_init(insize,outsize);
//	while(1){
	startTiming_Cyc();
	outvector = npu_matvec_int8_run(inVec,insize,outsize,identityWeights);
	uint32_t cycles =  getTiming_Cyc();
	printf("NPU int8 Cycles: %4d\n\r",cycles);
//		for(size_t i = 0;i < outsize;i++){
//			int8_t output = outvector[i];
//			printf("Output %2d: %4d\n\r",i,output);
//		}
//		printf("\n\r");
//	}
	free(identityWeights);
}


int NPU_MatMul_float(size_t insize,size_t outsize){
//	printf("=== NPU MatMul float ===\n\r");

    float inVec[insize];
    for (int i = 0; i < insize; i++) {
    	inVec[i] = (int8_t)((i) % 256);  // Example input: cycles through -128 to 127
    }
    float* identityWeights = getIdentityWeights_float(insize,outsize);
    float* outvector;

    npu_matvec_float_init(insize,outsize);
//	while(1){
    	startTiming_Cyc();
		outvector = npu_matvec_float_run(inVec,insize,outsize,identityWeights);
		uint32_t cycles =  getTiming_Cyc();
		printf("NPU float Cycles first: %4d\n\r",cycles);
		startTiming_Cyc();
		outvector = npu_matvec_float_run(inVec,insize,outsize,identityWeights);
		cycles =  getTiming_Cyc();
		printf("NPU float Cycles second: %4d\n\r",cycles);
//		for(size_t i = 0;i < outsize;i++){
//			float output = outvector[i];
//			printf("Output %2d: %4.0f\n\r",i,output);
//		}
//	}
	free(identityWeights);
}


int ARM_MatMul_int8(size_t insize,size_t outsize) {

    int8_t inVec[insize];
    for (int i = 0; i < insize; i++) {
    	inVec[i] = (int8_t)(i);  // e.g., 0, 16, 32, ..., 112
    	}
    int32_t outVec[outsize];

