xXAlgoorXx/Projectwork2_Code/ST32N6AI/image_classification/STM32N6/Application/NUCLEO-N657X0-Q/Src/main.c
    // Identity weight matrix
    int8_t* identityWeights = getIdentityWeights_int8(insize, outsize);

    if (!identityWeights) {
        printf("Memory allocation failed\n");
        return -1;
    }

//    for (int i = 0; i < insize; i++) {
//        printf("inVec[%d] = %4d", i, inVec[i]);
//    }
//    printf("\n\r");

//    while(1){
		// Start benchmarking
    	startTiming_Cyc();
    	simd_matrix_vector_mul_int8(identityWeights,inVec,outVec,outsize,insize);
		uint32_t cycles = getTiming_Cyc();

		printf("Output MatVec ARM\n\r");
		printf("Cycles ARM int8: %6d\n\r", cycles);
//		for(int i = 0; i < outsize; i++){
//			printf("Output[%d]: %4d\n\r",i,outVec[i]);
//		}
		startTiming_Cyc();
		controllOutput(inVec,identityWeights,insize,outsize);
		cycles = getTiming_Cyc();
		printf("Cycles Controll ARM int8: %6d\n\r", cycles);
//    }
	free(identityWeights);
    return 0;
}

int ARM_MatMul_float(size_t insize,size_t outsize) {

    float32_t inVec[insize];
    for (int i = 0; i < insize; i++) {
        inVec[i] = i * 1.0f;  // Example float input values
    }

    // Identity weight matrix
    float32_t* identityWeights = getIdentityWeights_float(insize, outsize);
    if (!identityWeights) {
        printf("Memory allocation failed\n");
        return -1;
    }

    float32_t dataOut[outsize];

    arm_matrix_instance_f32 in;
    arm_matrix_instance_f32 weight;
    arm_matrix_instance_f32 out;

    arm_mat_init_f32(&in, 1, insize, inVec);
    arm_mat_init_f32(&weight, insize, outsize, identityWeights);
    arm_mat_init_f32(&out, 1, outsize, dataOut);

//    while(1){
    	startTiming_Cyc();
		arm_status status = arm_mat_mult_f32(&in, &weight, &out);

		uint32_t cycles = getTiming_Cyc();
		printf("Cycles ARM float: %6d\n\r", cycles);
		float time = ((float)cycles / SystemCoreClock) * 1000.0f;

//		if (status == ARM_MATH_SUCCESS) {
//			printf("Time CMSIS float32: %f ms, Cycles: %lu\n\r", time, cycles);
//			for (int i = 0; i < outsize; ++i) {
//				printf("Out[%d]: %7.4f\n\r", i, dataOut[i]);
//			}
//		}
//		else {
//			printf("Matrix multiplication failed!\n");
//		}

//		free(identityWeights);
//    }
	free(identityWeights);
    return 0;
}

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */

int main_NPU_test(void)
{
    uint32_t cyclesInitNPU = 0;

    enableTiming_Cyc();
    BSP_LED_Init(LED_BLUE);
    Hardware_init();
    BSP_LED_On(LED_BLUE);
    printf("\n\r== Begin NPU Testing ==\n\r");

    /*** NN Init ****************************************************************/
    uint32_t nn_in_len = 0;
    int number_output = 0;
    int8_t *nn_out[MAX_NUMBER_OUTPUT];             // int8 output
    uint32_t nn_out_len[MAX_NUMBER_OUTPUT];
    int8_t* nn_in = NULL;

    LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(Default);

    startTiming_Cyc();
    NeuralNetwork_init(&nn_in, &nn_in_len, nn_out, &number_output, nn_out_len);
    cyclesInitNPU = getTiming_Cyc();

//    printf("Init cycles NPU: %lu cycles\n\r", cyclesInitNPU);
    printf("Input length: %lu bytes\n\r", nn_in_len);
//    printf("Number of output tensors: %d\n\r", number_output);
    printf("Output length: %lu bytes\n\r", nn_out_len[0]);
    printf("In pointer: %p\n\r",nn_in);
    printf("Out pointer: %p\n\r",nn_out[0]);

    /*** Prepare Input **********************************************************/
    int8_t matrix1[nn_in_len];
    for (int i = 0; i < nn_in_len; i++) {
        matrix1[i] = (int8_t)((i) % 256);  // Example input: cycles through -128 to 127
    }

    int8_t* identityWeights = getIdentityWeights_int8(nn_in_len,nn_out_len[0]);
	if (identityWeights == NULL) {
		// Handle error (e.g., return or log)
		printf("Error in weights Allocation");
	}

	size_t weight_size = nn_in_len * nn_out_len[0];  // Based on weight tensor shape in network.c
	int8_t* nnweights = (int8_t*)(0x34200000UL);
	size_t loopcount = 0;
//	setOutputZero(nn_out[0],nn_out_len[0]);
    while (1)
    {
    	printf("Loop count main:%4d\n\r",loopcount);
        uint32_t ts[2] = { 0 };
        uint32_t cyclesCPU = 0;
        uint32_t cyclesNPU = 0;

        // Prepare input buffer
        memcpy(nn_in, matrix1, nn_in_len);
        SCB_CleanDCache_by_Addr((void*)nn_in, nn_in_len);

        // Print input
		printf("Inputs: %p\n\r",nn_in);
		for (int i = 0; i < nn_in_len; i++) {
		    printf("%4d", nn_in[i]);
		}
		printf("\n\r");

        // Run NPU inference
		SCB_CleanDCache_by_Addr((void*)nnweights, weight_size);
        ts[0] = HAL_GetTick();

        startTiming_Cyc();
        LL_ATON_RT_Main(&NN_Instance_Default);
        cyclesNPU = getTiming_Cyc();
        ts[1] = HAL_GetTick();

        // Print output
        printf("NPU Output: %p\n\r",nn_out[0]);
        int j = 1;
		for (int i = 0; i < nn_out_len[0]; i++) {
			printf("%4d", nn_out[0][i]);
			if(j ==8){
				printf("\n\r");
				j = 0;
			}
			j++;
		}
		printf("\n\r");

		// Print control output for reference
        controllOutput(matrix1, nnweights, nn_in_len,nn_out_len[0]);
        uint32_t time_npu = ts[1] - ts[0];

//        printf("Inference time NPU: %lu ms\n\r", time_npu);
//        printf("Inference cycles NPU: %lu cycles\n\r", cyclesNPU);

        /*** Optional CPU Simulation (reference implementation) ***/
//        ts[0] = HAL_GetTick();
//        startTiming_Cyc();
//        nn_simulation_int8(nn_in_len,matrix1);
//        cyclesCPU = getTiming_Cyc();
//        ts[1] = HAL_GetTick();
//        uint32_t time_cpu = ts[1] - ts[0];

//        printf("Inference time CPU: %lu ms\n\r", time_cpu);
//        printf("Inference cycles CPU: %lu cycles\n\r", cyclesCPU);

        BSP_LED_Toggle(LED_BLUE);
        HAL_Delay(1000);

        // Set weights of NN to identity matrix
		update_weights_int8(nnweights, identityWeights, weight_size);
		loopcount++;
//		setOutputZero(nn_out[0],nn_out_len[0]);

